src/cf/Catalogs/fmBalanceUnits.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmBalanceUnits</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/fmStateBalanceUnit.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmStateBalanceUnit</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/fmBalanceUnits/Ext/ObjectModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

Var mIsNew; // Для определения при записи элемента новый или нет.
Var mOldCompany;
Var mOldResponsible;

Procedure OnWrite(Cancel)
	If mIsNew OR mOldResponsible<>Responsible Then
		NewRecord = InformationRegisters.fmStateBalanceUnit.CreateRecordManager();
		NewRecord.BalanceUnit = Ref;
		NewRecord.Responsible = Responsible;
		NewRecord.Period = CurrentSessionDate();
		Try
			NewRecord.Write();
		Except
		EndTry;
	EndIf;
EndProcedure

Procedure BeforeWrite(Cancel)
	mIsNew = IsNew();
	mOldResponsible = Ref.Responsible;
EndProcedure

#EndIf
